{
    "class_name": "Sequential", 
    "keras_version": "2.0.8", 
    "config": [
        {
            "class_name": "LSTM", 
            "config": {
                "recurrent_activation": "hard_sigmoid", 
                "dtype": "float32", 
                "trainable": true, 
                "recurrent_initializer": {
                    "class_name": "Orthogonal", 
                    "config": {
                        "seed": null, 
                        "gain": 1.0
                    }
                }, 
                "use_bias": true, 
                "bias_regularizer": null, 
                "return_state": false, 
                "unroll": false, 
                "bias_initializer": {
                    "class_name": "Zeros", 
                    "config": {}
                }, 
                "units": 256, 
                "batch_input_shape": [
                    null, 
                    100, 
                    1
                ], 
                "dropout": 0.0, 
                "recurrent_dropout": 0.0, 
                "kernel_initializer": {
                    "class_name": "VarianceScaling", 
                    "config": {
                        "distribution": "uniform", 
                        "scale": 1.0, 
                        "seed": null, 
                        "mode": "fan_avg"
                    }
                }, 
                "kernel_constraint": null, 
                "activation": "tanh", 
                "stateful": false, 
                "activity_regularizer": null, 
                "unit_forget_bias": true, 
                "recurrent_regularizer": null, 
                "name": "lstm_1", 
                "bias_constraint": null, 
                "go_backwards": false, 
                "implementation": 0, 
                "kernel_regularizer": null, 
                "return_sequences": true, 
                "recurrent_constraint": null
            }
        }, 
        {
            "class_name": "Dropout", 
            "config": {
                "rate": 0.2, 
                "trainable": true, 
                "name": "dropout_1"
            }
        }, 
        {
            "class_name": "LSTM", 
            "config": {
                "recurrent_activation": "hard_sigmoid", 
                "trainable": true, 
                "recurrent_initializer": {
                    "class_name": "Orthogonal", 
                    "config": {
                        "seed": null, 
                        "gain": 1.0
                    }
                }, 
                "use_bias": true, 
                "bias_regularizer": null, 
                "return_state": false, 
                "unroll": false, 
                "bias_initializer": {
                    "class_name": "Zeros", 
                    "config": {}
                }, 
                "units": 256, 
                "unit_forget_bias": true, 
                "dropout": 0.0, 
                "recurrent_dropout": 0.0, 
                "kernel_initializer": {
                    "class_name": "VarianceScaling", 
                    "config": {
                        "distribution": "uniform", 
                        "scale": 1.0, 
                        "seed": null, 
                        "mode": "fan_avg"
                    }
                }, 
                "kernel_constraint": null, 
                "activation": "tanh", 
                "stateful": false, 
                "activity_regularizer": null, 
                "recurrent_regularizer": null, 
                "name": "lstm_2", 
                "bias_constraint": null, 
                "go_backwards": false, 
                "implementation": 0, 
                "kernel_regularizer": null, 
                "return_sequences": false, 
                "recurrent_constraint": null
            }
        }, 
        {
            "class_name": "Dropout", 
            "config": {
                "rate": 0.2, 
                "trainable": true, 
                "name": "dropout_2"
            }
        }, 
        {
            "class_name": "Dense", 
            "config": {
                "kernel_initializer": {
                    "class_name": "VarianceScaling", 
                    "config": {
                        "distribution": "uniform", 
                        "scale": 1.0, 
                        "seed": null, 
                        "mode": "fan_avg"
                    }
                }, 
                "name": "dense_1", 
                "kernel_constraint": null, 
                "bias_regularizer": null, 
                "bias_constraint": null, 
                "activation": "softmax", 
                "trainable": true, 
                "kernel_regularizer": null, 
                "bias_initializer": {
                    "class_name": "Zeros", 
                    "config": {}
                }, 
                "units": 62, 
                "use_bias": true, 
                "activity_regularizer": null
            }
        }
    ], 
    "backend": "tensorflow"
}